# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "domt4/autoupdate"

# Binaries
brew "automake"
brew "autoconf"
brew "bash" # Bash 4
brew "coreutils" # Those that come with macOS are outdated
brew "ack"
brew "zlib"
brew "git"
brew "git-lfs"
brew "grep"
brew "libyaml"
brew "readline"
brew "libxslt"
brew "libtool"
brew "unixodbc"
brew "mas"
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash"
brew "tree"
brew "zsh"
brew "zsh-completions"
brew "openssl"
brew "libyaml"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "neovim"
brew "watchman"
brew "jq"
brew "cmake"
brew "diff-so-fancy"
brew "wxmac"
brew "hh"
brew "asdf"
brew "httpie"
brew "shellcheck"
brew "tflint"
brew "antibody"

# GitHub
brew "hub"
brew "gh"

# AWS
brew "awscli"

# Apps
cask "alfred"
cask "docker"
cask "github"
cask "visual-studio-code"
cask "dash"
cask "grammarly"
cask "macdown"
cask "postman"

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-fira-code"
cask "font-hasklig"
