# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "domt4/autoupdate"
tap "FelixKratz/formulae"

# Binaries
brew "automake" # Tool for automatically generating Makefiles
brew "autoconf" # Tool for automatically configuring source code
brew "bash" # Bash 4
brew "coreutils" # Those that come with macOS are outdated
brew "ack" # Search tool like grep
brew "zlib" # Compression library
brew "git" # Version control
brew "git-lfs" # Git extension for versioning large files
brew "grep" # Search tool
brew "libyaml" # YAML parser
brew "readline" # Library for command-line editing
brew "libxslt" # XSLT C library for GNOME
brew "libtool" # Generic library support script
brew "unixodbc" # ODBC driver manager
brew "mas" # Mac App Store CLI
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash" # Move files and folders to the trash
brew "tree" # List contents of directories in a tree-like format
brew "zsh" # Zsh
brew "zsh-completions" # Additional completion definitions for Zsh
brew "openssl" # SSL/TLS cryptography library
brew "reattach-to-user-namespace" # Reattach process (e.g., tmux) to the user's namespace
brew "the_silver_searcher" # Code-search similar to ack
brew "tmux" # Terminal multiplexer
brew "neovim" # Vim-fork focused on extensibility and usability
brew "watchman" # File watching service
brew "jq" # JSON parser
brew "yq" # YAML parser
brew "cmake" # Cross-platform make
brew "diff-so-fancy" # Better git diff
brew "wxwidgets" # C++ library for GUI
brew "hstr" # Improved command history
brew "httpie" # cURL with colors
brew "shellcheck" # Shell script analysis tool
brew "tflint" # Terraform linter
brew "antidote" # Zsh plugin manager
brew "eza" # modern ls replacement
brew "ripgrep" # grep replacement
brew "1password-cli" # 1Password CLI
brew "zoxide" # cd replacement
brew "fzf" # Fuzzy finder
brew "stow" # Symlink farm manager
brew "entr" # Run arbitrary commands when files change
brew "tokei" # Code statistics
brew "htop" # Improved top
brew "btop" # Better top
brew "k9s" # Kubernetes CLI
brew "bat" # Better cat
brew "fd" # FD
brew "atuin" # Atuin
brew "carapace" # shell completion
brew "rainfrog" # Database Client TUI
brew "sst/tap/opencode"
brew "sesh"
brew "gum"

# AWS
brew "awscli" # AWS CLI

# Apps
cask "bruno" # API Client
cask "orbstack" # Docker Desktop alternative
cask "shortcat" # Keyboard productivity app
# cask "brave-browser" # Brave Browser
brew "zen" # Zen browser
cask "readdle-spark" # Spark Email client
cask "obsidian" # Obsidian
cask "1password" # 1Password Password manager
# cask "docker" # Docker
# cask "visual-studio-code" # Visual Studio Code
cask "postman" # Postman
cask "proxyman" # Proxyman
cask "raycast" # Raycast
# cask "kitty" # Kitty terminal emulator
cask "ghostty" # Ghostty
cask "keycastr" # KeyCastr
cask "redisinsight" # RedisInsight
cask "nikitabobko/tap/aerospace" # i3-like window manager
cask "numi" # Better calculator
brew "borders" # Add colored borders to user windows
brew "starship" # shell prompt
brew "pearcleaner" # Clean up your system

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-fira-code"
cask "font-hasklig"
