# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "domt4/autoupdate"

# Binaries
brew "automake" # Tool for automatically generating Makefiles
brew "autoconf" # Tool for automatically configuring source code
brew "bash" # Bash 4
brew "coreutils" # Those that come with macOS are outdated
brew "ack" # Search tool like grep
brew "zlib" # Compression library
brew "git" # Version control
brew "git-lfs" # Git extension for versioning large files
brew "grep" # Search tool
brew "libyaml" # YAML parser
brew "readline" # Library for command-line editing
brew "libxslt" # XSLT C library for GNOME
brew "libtool" # Generic library support script
brew "unixodbc" # ODBC driver manager
brew "mas" # Mac App Store CLI
brew "pkg-config" # https://github.com/driesvints/dotfiles/issues/20
brew "trash" # Move files and folders to the trash
brew "tree" # List contents of directories in a tree-like format
brew "zsh" # Zsh
brew "zsh-completions" # Additional completion definitions for Zsh
brew "openssl" # SSL/TLS cryptography library
brew "reattach-to-user-namespace" # Reattach process (e.g., tmux) to the user's namespace
brew "the_silver_searcher" # Code-search similar to ack
brew "tmux" # Terminal multiplexer
brew "neovim" # Vim-fork focused on extensibility and usability
brew "watchman" # File watching service
brew "jq" # JSON parser
brew "cmake" # Cross-platform make
brew "diff-so-fancy" # Better git diff
brew "wxwidgets" # C++ library for GUI
brew "hstr" # Improved command history
brew "httpie" # cURL with colors
brew "shellcheck" # Shell script analysis tool
brew "tflint" # Terraform linter
brew "antibody" # Zsh plugin manager
brew "exa" # ls replacement
brew "ripgrep" # grep replacement
brew "1password-cli" # 1Password CLI
brew "zoxide" # cd replacement
brew "fzf" # Fuzzy finder
brew "stow" # Symlink farm manager
brew "entr" # Run arbitrary commands when files change
brew "tokei" # Code statistics

# AWS
brew "awscli" # AWS CLI

# Apps
cask "docker" # Docker
cask "visual-studio-code" # Visual Studio Code
cask "postman" # Postman
cask "proxyman" # Proxyman
cask "spacelauncher" # Space Launcher
cask "raycast" # Raycast
cask "kitty" # Kitty terminal emulator

# Fonts
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-fira-code"
cask "font-hasklig"
